export const MISSING_CODE_MARKERS = ['!', '@', '#', '$', '%'];

export const SPECIAL_ACCOUNT_MAPPING = new Map([
  ["與營業活動相關之資產／負債變動數", "與營業活動相關之資產及負債之淨變動合計"],
  ["營業活動之現金流量－直接法", "營業活動之淨現金流入（流出）"],
  ["營業活動之現金流量－間接法", "營業活動之淨現金流入（流出）"],
  ["投資活動之現金流量", "投資活動之淨現金流入（流出）"],
  ["籌資活動之現金流量","籌資活動之淨現金流入（流出）"],
  ["其他綜合損益(淨額)", "其他綜合損益（淨額）"],
  ["其他收益及費損淨額", "其他收益及費損淨額"],
  ["銷貨收入淨額", "銷貨收入淨額"],
  ["除列按攤銷後成本衡量金融資產淨損益", "除列按攤銷後成本衡量金融資產淨損益"],
  ["金融資產重分類淨損益－自按攤銷後成本衡量重分類至透過損益按公允價值衡量", "金融資產重分類淨損益－自按攤銷後成本衡量重分類至透過損益按公允價值衡量"],
  ["金融資產重分類淨損益－自透過其他綜合損益按公允價值衡量重分類至透過損益按公允價值衡量", "金融資產重分類淨損益－自透過其他綜合損益按公允價值衡量重分類至透過損益按公允價值衡量"]
])

export const SPECIAL_ACCOUNT_ASSIGNMENT = new Map([
  ["盈餘指撥及分配：", "B0"],
  ["其他資本公積變動：", "C0"],
  ["營業活動之現金流量－間接法", "AAAA0"],
  ["營業活動之現金流量－直接法", "AAAA1"]
])

export const ROOT_LEVEL = 2;